Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ལེགས་པ་རྗོད་དོ། །གཞན་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་དག་གི་ཡང་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་དོ།
en: They praise the perfection of ethical discipline, and also praise and take empathetic delight in others practicing the perfection of ethical discipline.

source: །དེ་ཚུལ་ཁྲིམས་དེས་ལྷའི་ཆེ་བ་ཉིད་དང་། མིའི་ཆེ་བ་ཉིད་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ། །དེ་ནོར་མེད་པའི་སེམས་ཅན་རྣམས་ལ་ནོར་བྱིན་ཞིང་ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་འགོད་དོ།
en: They acquire an exalted status among gods and an exalted status among human beings. They give wealth to beings who are without wealth, and establish them in ethical discipline.

source: །ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་དང་རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལ་རབ་ཏུ་འགོད་དོ། །དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་།
en: They establish them in ethical discipline, meditative stability, wisdom, liberation and seeing the wisdom of liberation.

source: རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་དེས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་ནས། ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་།
en: On the basis of that aggregate of ethical discipline, that aggregate of meditative stability, that aggregate of wisdom, that aggregate of liberation, and that aggregate of seeing the wisdom of liberation, they transcend the levels of the śrāvakas and pratyekabuddhas.

source: རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་དེ་ཉིད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །
en: Then, on the basis of that aggregate of ethical discipline, that aggregate of meditative stability, that aggregate of wisdom, that aggregate of liberation and that aggregate of seeing the wisdom of liberation, they enter a bodhisattva’s full maturity.

source: །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས། སེམས་ཅན་རྣམས་ཐེག་པ་གསུམ་ལ་སོ་སོར་འགོད་ཅིང་འཁོར་བ་ལས་ཡོངས་སུ་གྲོལ་བར་བྱེད་དོ།
en: Having turned the wheel of the Dharma, they establish beings individually in the three vehicles, and liberate them from cyclic existence.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱིས་མཐར་གྱིས་སྤྱོད་པ་ཡོད་པ་ཡིན་ཏེ། དེ་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་དོ།
en: Thus, Subhūti, although bodhisattva great beings do have their serial practice of ethical discipline, all of it is nonapprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: If you ask why, it is because it is in this way without essential nature. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བདག་ཀྱང་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །གཞན་ཡང་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: Moreover, Subhūti, bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment, themselves practice the perfection of tolerance, and they also encourage others toward the perfection of tolerance.

source: །བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ལེགས་པ་རྗོད་དོ། །གཞན་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་དག་གི་ཡང་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་དོ། །དེ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: They praise the perfection of tolerance, and also praise and take empathetic delight in others practicing the perfection of tolerance.

source: སེམས་ཅན་རྣམས་སྦྱིན་པས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་འགོད་དོ། །ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་།
en: When they practice the perfection of tolerance, they satisfy beings with gifts, establish them in ethical discipline, and establish them in meditative stability, wisdom, liberation, and seeing the wisdom of liberation.

source: རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལ་རབ་ཏུ་འགོད་དོ། །དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་།
en: Then, on the basis of that aggregate of ethical discipline, that aggregate of meditative stability, that aggregate of wisdom, that aggregate of liberation, and {Ki.

source: རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་དེས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་ནས།
en: VI: 4} that aggregate of seeing the wisdom of liberation, they transcend the levels of the śrāvakas and pratyekabuddhas.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་དེ་ཉིད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །
en: Then, on the basis of that aggregate of ethical discipline, that aggregate of meditative stability, that aggregate of wisdom, that aggregate of liberation, and that aggregate of seeing the wisdom of liberation, they enter a bodhisattva’s full maturity.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པས་མཐར་གྱིས་སྤྱོད་པ་ཡོད་པ་ཡིན་ཏེ། དེ་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་དོ།
en: Thus, Subhūti, although bodhisattva great beings do have their serial practice of tolerance, all of it is nonapprehended.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བདག་ཀྱང་དགེ་བའི་ཆོས་རྣམས་ལ་བརྩོན་འགྲུས་རྩོམ་མོ། །གཞན་ཡང་བརྩོན་འགྲུས་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །བརྩོན་འགྲུས་ཀྱི་ལེགས་པ་རྗོད་དོ།
en: Moreover, Subhūti, bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment, themselves undertake perseverance with respect to virtuous attributes, and they also encourage others toward perseverance.

source: །གཞན་བརྩོན་འགྲུས་རྩོམ་པ་དེ་དག་གི་ཡང་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་དོ། །དེ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་རྣམས་སྦྱིན་པས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །ཚུལ་ཁྲིམས་ལས་རབ་ཏུ་འགོད་དོ། །ཏིང་ངེ་འཛིན་དང་།
en: They praise perseverance, and also praise and take empathetic delight in others undertaking perseverance.

source: ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལ་རབ་ཏུ་འགོད་དོ། །དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་།
en: When they practice the perfection of perseverance, they satisfy beings with gifts, establish them in ethical discipline, and establish them in meditative stability, wisdom, liberation, and seeing the wisdom of liberation.

source: ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་དེས། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་ནས།
en: Then, on the basis of that aggregate of ethical discipline, that aggregate of meditative stability, that aggregate of wisdom, that aggregate of liberation, and that aggregate of seeing the wisdom of liberation, they transcend the levels of the śrāvakas and pratyekabuddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ནས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་རོ།
en: Having attained all-aspect omniscience, they turn the wheel of the Dharma.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱིས་མཐར་གྱིས་སྤྱོད་པ་ཡོད་པ་ཡིན་ཏེ། དེ་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་དོ།
en: Thus, Subhūti, although bodhisattva great beings do have their serial practice of perseverance, all of it is nonapprehended.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བདག་ཀྱང་ཚད་མེད་པ་དང་། བསམ་གཏན་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་གཞོག་གོ །གཞན་ཡང་ཚད་མེད་པ་དང་། བསམ་གཏན་དང་།
en: VI: 5} “Moreover, Subhūti, bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment, themselves become absorbed in the immeasurable attitudes, the meditative concentrations, and the formless absorptions, and they also encourage others toward the immeasurable attitudes, the meditative concentrations, and the formless absorptions.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་རབ་ཏུ་འགོད་དོ། །ཚད་མེད་པ་དང་། བསམ་གཏན་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱི་ལེགས་པ་རྗོད་དོ། །གཞན་ཚད་མེད་པ་དང་། བསམ་གཏན་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་མཉམ་པར་གཞག་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་དོ།
en: They praise the immeasurable attitudes, the meditative concentrations, and the formless absorptions, and also praise and take empathetic delight in others becoming absorbed in the immeasurable attitudes, the meditative concentrations, and the formless absorptions.

source: །དེ་ཚད་མེད་པ་དང་། བསམ་གཏན་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དག་ལ་གནས་ཤིང་། སེམས་ཅན་རྣམས་སྦྱིན་པས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་འགོད་དོ། །ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལ་རབ་ཏུ་འགོད་དོ།
en: When they maintain the immeasurable attitudes, the meditative concentrations, and the formless absorptions, they satisfy beings with gifts, establish them in ethical discipline, and establish them in meditative stability, wisdom, liberation, and seeing the wisdom of liberation.

source: །དེ་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བའི་ཕུང་པོ་དེས། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་ནས།
en: Then, on the basis of that aggregate of ethical discipline, that aggregate of meditative stability, that aggregate of wisdom, that aggregate of liberation, and that aggregate of seeing the wisdom of liberation, they transcend the levels of the śrāvakas and pratyekabuddhas.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱིས་མཐར་གྱིས་སྤྱོད་པ་ཡོད་པ་ཡིན་ཏེ། དེ་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་དོ།
en: Thus, Subhūti, although bodhisattva great beings do have their serial practice of meditative concentration, all of it is nonapprehended.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་སྦྱིན་པས་ཡོངས་སུ་ཚིམ་པར་བྱེད་དོ། །ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་འགོད་དོ། །ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ལ་རབ་ཏུ་འགོད་དོ།
en: Moreover, Subhūti, when bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment, practice the perfection of wisdom, they satisfy beings with gifts, establish them in ethical discipline, and establish them in meditative stability, wisdom, liberation, and seeing the wisdom of liberation.

source: །དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བདག་ཀྱང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ངོ་། །ཚུལ་ཁྲིམས་སྲུང་ངོ་། །བཟོད་པ་སྒྲུབ་བོ། །བརྩོན་འགྲུས་རྩོམ་མོ། །བསམ་གཏན་ལ་མཉམ་པར་གཞོག་གོ །ཤེས་རབ་སྒོམ་མོ། །གཞན་ཡང་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ལ་རབ་ཏུ་གཞོག་གོ །སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་ལེགས་པ་རྗོད་དོ།
en: When they practice the perfection of wisdom, they themselves dispense gifts, maintain ethical discipline, achieve tolerance, undertake perseverance, become absorbed in meditative concentration, and cultivate wisdom, and they also establish others in generosity, ethical discipline, tolerance, perseverance, meditative concentration, and wisdom.

source: །གཞན་གང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་དང་། ཚུལ་ཁྲིམས་སྲུང་བ་དང་། བཟོད་པ་སྒྲུབ་པ་དང་། བརྩོན་འགྲུས་བརྩོམ་པ་དང་། བསམ་གཏན་ལ་མཉམ་པར་གཞོག་པ་དང་། ཤེས་རབ་བསྒོམ་པ་དེ་དག་གི་ཡང་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་དོ།
en: They praise generosity, ethical discipline, tolerance, perseverance, meditative concentration, and wisdom, and also praise and take empathetic delight in others dispensing gifts, maintain ethical discipline, achieve tolerance, undertake perseverance, become absorbed in meditative concentration, and cultivate wisdom.

source: །དེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: When they practice the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, through skill in means {Ki.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་དང་། ཐབས་མཁས་པས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་ནས།
en: VI: 6} they transcend the levels of the śrāvakas and pratyekabuddhas, and then they enter a bodhisattva’s full maturity.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་ནས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ།
en: Having entered into the maturity of the bodhisattvas, they refine the buddhafields, bring beings to maturity, and then attain all-aspect omniscience.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱིས་མཐར་གྱིས་སྤྱོད་པ་རྩོམ་སྟེ། དེ་ཐམས་ཅད་ཀྱང་དམིགས་སུ་མེད་དོ།
en: Thus, Subhūti, although bodhisattva great beings do have their serial practice of wisdom, all of it is nonapprehended.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཐར་གྱིས་སྤྱད་པ་དང་། མཐར་གྱིས་བསླབ་པ་དང་། མཐར་གྱིས་འཇུག་པ་ལ་སློབ་སྟེ།
en: Moreover, Subhūti, bodhisattva great beings should train in serial practice, serial training, and serial progress.

source: དེ་སེམས་དང་པོ་བསྐྱེད་པ་ཉིད་ཀྱི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་རྟོགས་པར་བྱེད་དེ།
en: When they initially set their minds on enlightenment, through focusing their attention with all-aspect omniscience in mind they realize that all phenomena have the essential nature of nonentity.

source: དེ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་མོ།
en: They should cultivate the recollection of the Buddha.

source: །ཆོས་རྗེས་སུ་དྲན་པ་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པ་བསྒོམ་མོ།
en: They should cultivate the recollection of the Dharma, the recollection of the Saṅgha, the recollection of ethical discipline, the recollection of giving away, and the recollection of the god realms. “

source: །རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྒོམ་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གཟུགས་སུ་ཡིད་ལ་མི་བྱེད།
en: Subhūti, if you ask how bodhisattva great beings should cultivate the recollection of the Buddha, in this regard, Subhūti, bodhisattva great beings do not focus their attention on the tathāgatas, arhats, completely awakened buddhas because of physical forms.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པར་ཡིད་ལ་མི་བྱེད་དོ།
en: They do not focus their attention on them because of feelings, perceptions, formative predispositions, or consciousness.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་གཟུགས་ལ་ངོ་བོ་ཉིད་མེད་དོ།
en: If you ask why, it is because physical forms are without essential nature.

source: །གང་ལ་ངོ་བོ་ཉིད་མེད་པ་དེ་ནི་དངོས་པོ་མེད་པའོ།
en: That which is without essential nature is a nonentity.

source: །དངོས་པོ་མེད་པས་ནི་དངོས་པོ་མེད་པ་དྲན་པར་མི་ནུས་ཏེ།
en: Nonentities cannot recollect nonentities.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱེད་པ་མེད་པ་ནི། སངས་རྒྱས་རྗེས་སུ་དྲན་པའོ།
en: If you ask why, it is because being without recollection and being without attention is the recollection of the Buddha. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྒོམ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ཡིད་ལ་མི་བྱེད།
en: Moreover, Subhūti, when bodhisattva great beings cultivate the recollection of the Buddha, they do not focus their attention on the tathāgatas, arhats, completely awakened buddhas because of the thirty-two major marks of a great person.

source: སྐུ་གསེར་གྱི་ཁ་དོག་གིས་ཡིད་ལ་མི་བྱེད།
en: They do not focus attention on them because of the golden complexion of their bodies, {Ki.

source: འོད་འདོམ་གང་བས་ཡིད་ལ་མི་བྱེད།
en: VI: 7} and they do not focus attention on them because of their aureoles, extending a full arm span.

source: དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་ཡིད་ལ་མི་བྱེད་དོ།
en: They do not focus attention on them because of the eighty minor marks.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་དག་ལ་ངོ་བོ་ཉིད་མེད་དེ།
en: If you ask why, it is because these are without essential nature.

source: གང་ལ་ངོ་བོ་ཉིད་མེད་པ་དེ་ནི་དངོས་པོ་མེད་པའོ།
en: That which is without essential nature is a nonentity.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱ་བ་མེད་པ་ནི་སངས་རྒྱས་རྗེས་སུ་དྲན་པའོ།
en: If you ask why, it is because being without recollection and being without attention is the recollection of the Buddha. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྒོམ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོར་ཡིད་ལ་མི་བྱེད། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings cultivate the recollection of the Buddha, they do not focus their attention on the tathāgatas, arhats, completely awakened buddhas because of the aggregate of ethical discipline.

source: ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པའི་ཕུང་པོར་ཡིད་ལ་མི་བྱེད་དེ།
en: They do not focus their attention on them because of the aggregate of meditative stability, the aggregate of wisdom, the aggregate of liberation, or the aggregate of seeing the wisdom of liberation.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་དག་ལ་ངོ་བོ་ཉིད་མེད་དེ།
en: If you ask why, it is because these are without essential nature.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱ་བ་མེད་པ་ནི། སངས་རྒྱས་རྗེས་སུ་དྲན་པའོ།
en: If you ask why, it is because being without recollection and being without attention is the recollection of the Buddha. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྒོམ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུས་ཡིད་ལ་མི་བྱེད།
en: Moreover, Subhūti, when bodhisattva great beings cultivate the recollection of the Buddha, they do not focus their attention on the tathāgatas, arhats, completely awakened buddhas because of the ten powers of the tathāgatas.

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱིས་ཡིད་ལ་མི་བྱེད་དེ།
en: They do not focus their attention on them because of the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas.

source: གང་ལ་ངོ་བོ་ཉིད་མེད་པ་དེ་དག་ནི་དངོས་པོ་མེད་པའོ།
en: That which is without essential nature is a nonentity.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྒོམ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བར་ཡིད་ལ་མི་བྱེད་དོ།
en: Moreover, Subhūti, when bodhisattva great beings cultivate the recollection of the Buddha, they do not focus their attention on the tathāgatas, arhats, completely awakened buddhas because of the links of dependent origination.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་ལ་ངོ་བོ་ཉིད་མེད་དེ།
en: If you ask why, it is because these are without essential nature.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་བསྒོམ་པར་བྱའོ། །དེ་ལྟར་ན་མཐར་གྱིས་སྤྱད་པ་དང་། མཐར་གྱིས་བསླབ་པ་དང་།
en: It is in this way, Subhūti, that bodhisattva great beings who practice the perfection of wisdom should cultivate the recollection of the Buddha, [knowing that] all phenomena have the essential nature of nonentity. “

source: མཐར་གྱིས་འཇུག་པའི་ལམ་ཡོད་པ་ཡིན་ཏེ། དེ་མཐར་གྱིས་སྤྱད་པ་ལ་སློབ་ཅིང་། མཐར་གྱིས་སློབ་པ་དང་། མཐར་གྱིས་འཇུག་པའི་ལམ་ལ་སློབ་པས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་གྱིས། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་།
en: It is in this way that serial practice, serial training, and serial progress are discerned.

source: ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་།
en: Those who train in serial practice, and who train in serial training and serial progress, will, on the basis of the essential nature of nonentity, perfect all the perfections, all the aspects of emptiness, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They will perfect the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, and the nine serial steps of meditative absorption.

source: །སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་དང་། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །མངོན་པར་ཤེས་པ་དང་།
en: They will perfect the meditative stability of emptiness, the meditative stability of signlessness, {Ki.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: VI: 8} and the meditative stability of wishlessness.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They will perfect the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, and great compassion.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They will perfect the eighteen distinct qualities of the buddhas, and they will perfect [the goals], up to and including all-aspect omniscience.

source: །དེ་ནི་ཆོས་ཐམས་ཅད་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: They will attain consummate buddhahood, [knowing that] all phenomena have the essential nature of nonentity.

source: དེ་ལ་དངོས་པོ་ཡོད་པར་འདུ་ཤེས་པ་འམ། དངོས་པོ་མེད་པར་འདུ་ཤེས་པ་ཡང་མེད་ན། དྲན་པའི་ལས་རྡུལ་ཙམ་ཡང་ཡོད་པ་འམ། དྲན་པ་དང་བྲལ་བར་འགྱུར་བ་ལྟ་ཅི་ཞིག་སྨོས།
en: Since the perception of entities and the perception of nonentities are both nonexistent in it, how could there possibly be even a speck of actions based on recollection, or without recollection! “

source: རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་རྗེས་སུ་དྲན་པ་སྒོམ་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དེ་ཆོས་རྗེས་སུ་དྲན་པ་སྒོམ་ན། དགེ་བའི་ཆོས་ཡིད་ལ་མི་བྱེད།
en: Subhūti, if one were to ask how bodhisattva great beings should cultivate the recollection of the Dharma, in that case, Subhūti, when bodhisattva great beings practice the perfection of wisdom, in cultivating the recollection of the Dharma, they should not focus their attention on virtuous phenomena.

source: མི་དགེ་བའི་ཆོས་ཡིད་ལ་མི་བྱེད། འཇིག་རྟེན་པའི་ཆོས་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་དང་། ཟང་ཟིང་དང་བཅས་པའི་ཆོས་དང་། ཟང་ཟིང་མེད་པའི་ཆོས་དང་། འཕགས་པའི་ཆོས་དང་། འཕགས་པ་མ་ཡིན་པའི་ཆོས་དང་། ཟག་པ་དང་བཅས་པའི་ཆོས་དང་། ཟག་པ་མེད་པའི་ཆོས་དང་།
en: They should not focus their attention on nonvirtuous phenomena.

source: འདོད་པའི་ཁམས་སུ་གཏོགས་པའི་ཆོས་དང་། གཟུགས་ཀྱི་ཁམས་སུ་གཏོགས་པའི་ཆོས་དང་། གཟུགས་མེད་པའི་ཁམས་སུ་གཏོགས་པའི་ཆོས་དང་། འདུས་བྱས་ཀྱི་ཆོས་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་ཡིད་ལ་མི་བྱེད་དོ།
en: They should not focus their attention on mundane phenomena, supramundane phenomena, worldly phenomena, nonworldly phenomena, noble phenomena, ignoble phenomena, contaminated phenomena, uncontaminated phenomena, phenomena included in the realm of desire, phenomena included in the realm of form, phenomena included in the realm of formlessness, conditioned phenomena, or unconditioned phenomena.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་དེ་དག་ལ་ངོ་བོ་ཉིད་མེད་དེ།
en: If you ask why, it is because these phenomena are without essential nature.
